/* package up error # */
"error %1$d" = "ошибка %1$d";
"error %1$#x" = "ошибка %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Неизвестная ошибка: 0";

/* errno error 1 */
"Operation not permitted" = "Операция не разрешена";

/* errno error 2 */
"No such file or directory" = "Файл или каталог не существуют";

/* errno error 3 */
"No such process" = "Нет такого процесса";

/* errno error 4 */
"Interrupted system call" = "Прерванный системный вызов";

/* errno error 5 */
"Input/output error" = "Ошибка ввода/вывода";

/* errno error 6 */
"Device not configured" = "Устройство не сконфигурировано";

/* errno error 7 */
"Argument list too long" = "Список аргументов слишком длинный";

/* errno error 8 */
"Exec format error" = "Ошибка формата выполнения";

/* errno error 9 */
"Bad file descriptor" = "Неверное описание файла";

/* errno error 10 */
"No child processes" = "Нет дочерних процессов";

/* errno error 11 */
"Resource deadlock avoided" = "Блокировка ресурса пропущена";

/* errno error 12 */
"Cannot allocate memory" = "Не удается выделить память";

/* errno error 13 */
"Permission denied" = "Доступ запрещен";

/* errno error 14 */
"Bad address" = "Неверный адрес";

/* errno error 15 */
"Block device required" = "Требуется блоковое устройство";

/* errno error 16 */
"Resource busy" = "Ресурс занят";

/* errno error 17 */
"File exists" = "Файл существует";

/* errno error 18 */
"Cross-device link" = "Перекрестная ссылка";

/* errno error 19 */
"Operation not supported by device" = "Операция устройством не поддерживается";

/* errno error 20 */
"Not a directory" = "Не каталог";

/* errno error 21 */
"Is a directory" = "Каталог";

/* errno error 22 */
"Invalid argument" = "Неверный аргумент";

/* errno error 23 */
"Too many open files in system" = "В системе открыто слишком много файлов";

/* errno error 24 */
"Too many open files" = "Открыто слишком много файлов";

/* errno error 25 */
"Inappropriate ioctl for device" = "Неcоответствующий ioctl для устройства";

/* errno error 26 */
"Text file busy" = "Текстовый файл занят";

/* errno error 27 */
"File too large" = "Слишком большой файл";

/* errno error 28 */
"No space left on device" = "На устройстве нет больше места";

/* errno error 29 */
"Illegal seek" = "Неверный поиск";

/* errno error 30 */
"Read-only file system" = "Файловая система доступна только для чтения";

/* errno error 31 */
"Too many links" = "Слишком много ссылок";

/* errno error 32 */
"Broken pipe" = "Разорванный канал";

/* errno error 33 */
"Numerical argument out of domain" = "Численный аргумент вне домена";

/* errno error 34 */
"Result too large" = "Слишком большой результат";

/* errno error 35 */
"Resource temporarily unavailable" = "Ресурс временно недоступен.";

/* errno error 36 */
"Operation now in progress" = "Операция в процессе выполнения";

/* errno error 37 */
"Operation already in progress" = "Операция уже выполняется";

/* errno error 38 */
"Socket operation on non-socket" = "Попытка выполнения операции сокета не для объекта-сокета.";

/* errno error 39 */
"Destination address required" = "Требуется адрес назначения";

/* errno error 40 */
"Message too long" = "Слишком длинное сообщение";

/* errno error 41 */
"Protocol wrong type for socket" = "Неверный тип протокола";

/* errno error 42 */
"Protocol not available" = "Протокол недоступен";

/* errno error 43 */
"Protocol not supported" = "Протокол не поддерживается";

/* errno error 44 */
"Socket type not supported" = "Тип сокета не поддерживается";

/* errno error 45 */
"Operation not supported" = "Операция не поддерживается";

/* errno error 46 */
"Protocol family not supported" = "Семейство протоколов не поддерживается";

/* errno error 47 */
"Address family not supported by protocol family" = "Семейство адресов не поддерживается семейством протоколов";

/* errno error 48 */
"Address already in use" = "Адрес уже используется";

/* errno error 49 */
"Can't assign requested address" = "Не удается назначить запрашиваемый адрес";

/* errno error 50 */
"Network is down" = "Сеть неисправна";

/* errno error 51 */
"Network is unreachable" = "Сеть недоступна";

/* errno error 52 */
"Network dropped connection on reset" = "Сеть прервала подключение при сбросе";

/* errno error 53 */
"Software caused connection abort" = "Программа вызвала разрыв подключения";

/* errno error 54 */
"Connection reset by peer" = "Подключение сброшено узлом соединения";

/* errno error 55 */
"No buffer space available" = "В буфере нет места";

/* errno error 56 */
"Socket is already connected" = "Сокет уже подключен";

/* errno error 57 */
"Socket is not connected" = "Сокет не подключен";

/* errno error 58 */
"Can't send after socket shutdown" = "Не удается отправить после выключения сокета";

/* errno error 59 */
"Too many references: can't splice" = "Слишком много ссылок: не удается связать";

/* errno error 60 */
"Operation timed out" = "Операция превысила ресурс времени";

/* errno error 61 */
"Connection refused" = "Подключение отклонено";

/* errno error 62 */
"Too many levels of symbolic links" = "Слишком много уровней символьных ссылок";

/* errno error 63 */
"File name too long" = "Слишком длинное имя файла";

/* errno error 64 */
"Host is down" = "Хост выключился";

/* errno error 65 */
"No route to host" = "Нет маршрутизации";

/* errno error 66 */
"Directory not empty" = "Непустая папка";

/* errno error 67 */
"Too many processes" = "Слишком много процессов";

/* errno error 68 */
"Too many users" = "Слишком много пользователей";

/* errno error 69 */
"Disc quota exceeded" = "Квота диска исчерпана";

/* errno error 70 */
"Stale NFS file handle" = "Устаревший обработчик файла NFS";

/* errno error 71 */
"Too many levels of remote in path" = "Слишком много удаленных уровней в пути";

/* errno error 72 */
"RPC struct is bad" = "Неверная структура RPC";

/* errno error 73 */
"RPC version wrong" = "Неправильная версия RPC";

/* errno error 74 */
"RPC prog. not avail" = "Программа RPC не доступна";

/* errno error 75 */
"Program version wrong" = "Неверная версия программы";

/* errno error 76 */
"Bad procedure for program" = "Неверная процедура для программы";

/* errno error 77 */
"No locks available" = "Нет доступных защит";

/* errno error 78 */
"Function not implemented" = "Неприменимая функция";

/* errno error 79 */
"Inappropriate file type or format" = "Несоответствующий тип файла или формат";

/* errno error 80 */
"Authentication error" = "Ошибка идентификации";

/* errno error 81 */
"Need authenticator" = "Необходим идентификатор";

/* errno error 82 */
"Device power is off" = "Питание устройства выключено";

/* errno error 83 */
"Device error" = "Ошибка устройства";

/* errno error 84 */
"Value too large to be stored in data type" = "Слишком большое значение для хранения в типе данных";

/* errno error 85 */
"Bad executable (or shared library)" = "Невыполнимая программа (или общая библиотека)";

/* errno error 86 */
"Bad CPU type in executable" = "Неверный тип центрального процессора (CPU)";

/* errno error 87 */
"Shared library version mismatch" = "Несоответствие версии общей библиотеки";

/* errno error 88 */
"Malformed Mach-o file" = "Неправильно сформированный Mach-o файл";

/* errno error 89 */
"Operation canceled" = "Операция отменена";

/* errno error 90 */
"Identifier removed" = "Идентификатор удален";

/* errno error 91 */
"No message of desired type" = "Нет сообщений нужного типа";

/* errno error 92 */
"Illegal byte sequence" = "Недопустимая последовательность байтов";

/* errno error 93 */
"Attribute not found" = "Атрибут не найден";

/* errno error 94 */
"Bad message" = "Неверное сообщение";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (зарезервировано)";

/* errno error 96 */
"No message available on STREAM" = "Нет доступных сообщений в STREAM";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (зарезервировано)";

/* errno error 98 */
"No STREAM resources" = "Нет ресурсов STREAM";

/* errno error 99 */
"Not a STREAM" = "Не STREAM";

/* errno error 100 */
"Protocol error" = "Ошибка протокола";

/* errno error 101 */
"STREAM ioctl timeout" = "Истекло время ожидания STREAM ioctl";

/* errno error 102 */
"Operation not supported on socket" = "Операция не поддерживается на сокете";

/* errno error 103 */
"Policy not found" = "Политика не найдена";
